Masmiseim36/nxpSDK/devices/MK02F12810/MK02F12810.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX</name>
      <description>DMA channel multiplexor</description>
      <prependToName>DMAMUX_</prependToName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CHCFG%s</name>
          <description>Channel Configuration register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>DMA Channel Source (Slot)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable_Signal</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0_Rx_Signal</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART0_Tx_Signal</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1_Rx_Signal</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>UART1_Tx_Signal</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>SPI0_Rx_Signal</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>SPI0_Tx_Signal</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>I2C0_Signal</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>FTM0_Channel0_Signal</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>FTM0_Channel1_Signal</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>FTM0_Channel2_Signal</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>FTM0_Channel3_Signal</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>FTM0_Channel4_Signal</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>FTM0_Channel5_Signal</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>FTM1_Channel0_Signal</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>FTM1_Channel1_Signal</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>FTM2_Channel0_Signal</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>FTM2_Channel1_Signal</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40</name>
                  <description>ADC0_Signal</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>42</name>
                  <description>CMP0_Signal</description>
                  <value>#101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>43</name>
                  <description>CMP1_Signal</description>
                  <value>#101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>45</name>
                  <description>DAC0_Signal</description>
                  <value>#101101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48</name>
                  <description>PDB_Signal</description>
                  <value>#110000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>49</name>
                  <description>PortA_Signal</description>
                  <value>#110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50</name>
                  <description>PortB_Signal</description>
                  <value>#110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>51</name>
                  <description>PortC_Signal</description>
                  <value>#110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>52</name>
                  <description>PortD_Signal</description>
                  <value>#110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>53</name>
                  <description>PortE_Signal</description>
                  <value>#110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>60</name>
                  <description>AlwaysOn60_Signal</description>
                  <value>#111100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>61</name>
                  <description>AlwaysOn61_Signal</description>
                  <value>#111101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>62</name>
                  <description>AlwaysOn62_Signal</description>
                  <value>#111110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>AlwaysOn63_Signal</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG</name>
              <description>DMA Channel Trigger Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Triggering is disabled. If triggering is disabled and ENBL is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Triggering is enabled. If triggering is enabled and ENBL is set, the DMAMUX is in Periodic Trigger mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBL</name>
              <description>DMA Channel Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DMA channel is disabled. This mode is primarily used during configuration of the DMAMux. The DMA has separate channel enables/disables, which should be used to disable or reconfigure a DMA channel.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DMA channel is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
